In [11]:
import numpy as np
import pandas as pd

In [12]:
# Pandas <= numpy

#python으로 하는 excel..
#datatype
# 1. Series <- numpy 1차원 vector 
# 2. DataFrame <- series 여러개가 column으로 이어서 만들어진 matrix <- numpy matrix

### Series    
 * numpy array vector -> index가 없다
 * series <= numpy array vector + index
 * pd.Series()

In [13]:
L = [1,2,3,4]
s = pd.Series(L)
s

0    1
1    2
2    3
3    4
dtype: int64

In [14]:
L = [1,2,3,4]
s = pd.Series(L, index = ['a', 'b', 'c', 'd'])
s

a    1
b    2
c    3
d    4
dtype: int64

In [15]:
s['c']

3

In [16]:
s['c'] = 10
s

a     1
b     2
c    10
d     4
dtype: int64

In [17]:
s[['c','d']]   # 여러개의 요소를 넣을때 리스트로 넣어줘야 한다

c    10
d     4
dtype: int64

In [20]:
s > 5   # broadcasting > element wise operating

a    False
b    False
c     True
d    False
dtype: bool

In [21]:
s[s>5]   # boolean indexing

c    10
dtype: int64

In [22]:
s * 2

a     2
b     4
c    20
d     8
dtype: int64

In [23]:
'a' in s

True

In [24]:
s

a     1
b     2
c    10
d     4
dtype: int64

In [25]:
s.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [26]:
s.values

array([ 1,  2, 10,  4], dtype=int64)

In [27]:
s.index = ['가', '나', '다', '라']
s

가     1
나     2
다    10
라     4
dtype: int64

## DataFrame
* series 가 column 단위로 붙어서 만들어진 matrix (series => dataframe)
* pd.DataFrame()

In [31]:
import numpy as np
import pandas as pd

In [75]:
raw_data = {'first_name':['jason', np.nan, 'tina', 'jake', 'amy'], 
            'last_name': ['miller', np.nan, 'ali', 'milner', 'coozer'],
            'age': [42, np.nan, 36, 24, 73],
            'pretestscore': [4, np.nan, np.nan, 2, 4],
            'postestscore': [25, np.nan, np.nan, 62, 72]}

In [76]:
# dict key => columns
# dict value => columns값

df =  pd.DataFrame(raw_data)
df

  first_name last_name   age  pretestscore  postestscore
0      jason    miller  42.0           4.0          25.0
1        NaN       NaN   NaN           NaN           NaN
2       tina       ali  36.0           NaN           NaN
3       jake    milner  24.0           2.0          62.0
4        amy    coozer  73.0           4.0          72.0

In [77]:
# # 데이터를 가공할 떄 일반적 보편적 처리 방식

# column - 특징을 칼럼으로 잡는다. 예- 학생 학년, 이름, 주소, 성적 ..
# row - 개별 데이터  예- 첫번째 학생, 두번째 학생.. 

# column - feature, 열
# row- data, 행

In [78]:
# 하나의 칼럼 - 하나의 series < np.array < 원소가 동일한 데이터타입으로 구성..
# dataframe - series가 연결된 matrix 

# 하나의 칼럼에는 동일한 타입의 데이터로 구성된다
# 칼럼 간에는 다른 데이터타입의 칼럼들이 존재한다..

In [79]:
# column indexing => df[col_name]

In [80]:
df.head(2)

  first_name last_name   age  pretestscore  postestscore
0      jason    miller  42.0           4.0          25.0
1        NaN       NaN   NaN           NaN           NaN

In [81]:
df['first_name']

0    jason
1      NaN
2     tina
3     jake
4      amy
Name: first_name, dtype: object

In [82]:
df[['last_name','age']]

  last_name   age
0    miller  42.0
1       NaN   NaN
2       ali  36.0
3    milner  24.0
4    coozer  73.0

In [110]:
df.first_name

# 속성으로 칼럼을 접근하는 방식

#  칼럼이름에 space가 있으면 안됨

a    jason
b      NaN
c     tina
d     jake
e      amy
Name: first_name, dtype: object

In [84]:
# df['age'] = df['age'].apply(lambda x : x*10)

In [85]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [86]:
df.columns

Index(['first_name', 'last_name', 'age', 'pretestscore', 'postestscore'], dtype='object')

In [87]:
df.values

array([['jason', 'miller', 42.0, 4.0, 25.0],
       [nan, nan, nan, nan, nan],
       ['tina', 'ali', 36.0, nan, nan],
       ['jake', 'milner', 24.0, 2.0, 62.0],
       ['amy', 'coozer', 73.0, 4.0, 72.0]], dtype=object)

In [88]:
# row indexing

# df.loc[index name] 
# df.iloc[index order num] 

#loc[], iloc[] - row와 column을 동시에 선택할 수도 있다

In [89]:
df.index = ['a','b','c','d','e']
df

  first_name last_name   age  pretestscore  postestscore
a      jason    miller  42.0           4.0          25.0
b        NaN       NaN   NaN           NaN           NaN
c       tina       ali  36.0           NaN           NaN
d       jake    milner  24.0           2.0          62.0
e        amy    coozer  73.0           4.0          72.0

In [90]:
df.loc['d']  # 인덱스로

first_name        jake
last_name       milner
age               24.0
pretestscore       2.0
postestscore      62.0
Name: d, dtype: object

In [91]:
df.iloc[3]  # 순번

first_name        jake
last_name       milner
age               24.0
pretestscore       2.0
postestscore      62.0
Name: d, dtype: object

In [92]:
df.iloc[3:]

  first_name last_name   age  pretestscore  postestscore
d       jake    milner  24.0           2.0          62.0
e        amy    coozer  73.0           4.0          72.0

In [93]:
df.loc['d':]

  first_name last_name   age  pretestscore  postestscore
d       jake    milner  24.0           2.0          62.0
e        amy    coozer  73.0           4.0          72.0

In [94]:
df.loc[['c','e']]

  first_name last_name   age  pretestscore  postestscore
c       tina       ali  36.0           NaN           NaN
e        amy    coozer  73.0           4.0          72.0

In [95]:
df.iloc[[2,4]]

  first_name last_name   age  pretestscore  postestscore
c       tina       ali  36.0           NaN           NaN
e        amy    coozer  73.0           4.0          72.0

In [96]:
df.loc['b':'d']

  first_name last_name   age  pretestscore  postestscore
b        NaN       NaN   NaN           NaN           NaN
c       tina       ali  36.0           NaN           NaN
d       jake    milner  24.0           2.0          62.0

In [97]:
df.loc['c','last_name']

'ali'

In [98]:
df.iloc[2,1]

'ali'

In [99]:
df.loc[['c','d'],'first_name':'age']  #슬라이싱은 대괄호 필요없다

  first_name last_name   age
c       tina       ali  36.0
d       jake    milner  24.0

In [100]:
df.iloc[[2,3], :3]

  first_name last_name   age
c       tina       ali  36.0
d       jake    milner  24.0

In [101]:
df

  first_name last_name   age  pretestscore  postestscore
a      jason    miller  42.0           4.0          25.0
b        NaN       NaN   NaN           NaN           NaN
c       tina       ali  36.0           NaN           NaN
d       jake    milner  24.0           2.0          62.0
e        amy    coozer  73.0           4.0          72.0

In [102]:
df.loc['d','pretestscore'] = 100.0
df

  first_name last_name   age  pretestscore  postestscore
a      jason    miller  42.0           4.0          25.0
b        NaN       NaN   NaN           NaN           NaN
c       tina       ali  36.0           NaN           NaN
d       jake    milner  24.0         100.0          62.0
e        amy    coozer  73.0           4.0          72.0

In [103]:
df.loc[['c','e'], ['age','postestscore']]

    age  postestscore
c  36.0           NaN
e  73.0          72.0

In [104]:
df.iloc[[3,4], [3,4]]

   pretestscore  postestscore
d         100.0          62.0
e           4.0          72.0

In [109]:
df.iloc[1::2, :]  # 홀수번째 행만 출력

  first_name last_name   age  pretestscore  postestscore
b        NaN       NaN   NaN           NaN           NaN
d       jake    milner  24.0         100.0          62.0

In [113]:
# dataframe 에 boolean indexing 도 가능함 => row indexing : loc[]

In [114]:
df

  first_name last_name   age  pretestscore  postestscore
a      jason    miller  42.0           4.0          25.0
b        NaN       NaN   NaN           NaN           NaN
c       tina       ali  36.0           NaN           NaN
d       jake    milner  24.0         100.0          62.0
e        amy    coozer  73.0           4.0          72.0

In [117]:
df.loc[df['age'] >= 40]

  first_name last_name   age  pretestscore  postestscore
a      jason    miller  42.0           4.0          25.0
e        amy    coozer  73.0           4.0          72.0

In [118]:
# 'last_name'이 'ali'인 사람의 데이터를 출력

In [120]:
df.loc[df['last_name']== 'ali']

  first_name last_name   age  pretestscore  postestscore
c       tina       ali  36.0           NaN           NaN

In [126]:
# 나이가 40 이상인 사람의 postestscore 평균점수는 얼마인가?

In [132]:
# boolean test먼저 하고 df.loc씌우기

df.loc[df['age'] >40]['postestscore'].mean()

48.5

In [133]:
# 새로운 column 추가

In [134]:
df['address'] = ['seoul','incheon','daejeon','pusan','gwangju']
df

  first_name last_name   age  pretestscore  postestscore  address
a      jason    miller  42.0           4.0          25.0    seoul
b        NaN       NaN   NaN           NaN           NaN  incheon
c       tina       ali  36.0           NaN           NaN  daejeon
d       jake    milner  24.0         100.0          62.0    pusan
e        amy    coozer  73.0           4.0          72.0  gwangju

In [135]:
df.columns = ['fn','ln','age','pres','posts','add']
df

      fn      ln   age   pres  posts      add
a  jason  miller  42.0    4.0   25.0    seoul
b    NaN     NaN   NaN    NaN    NaN  incheon
c   tina     ali  36.0    NaN    NaN  daejeon
d   jake  milner  24.0  100.0   62.0    pusan
e    amy  coozer  73.0    4.0   72.0  gwangju

In [138]:
df.rename(columns = {'add' : 'address'})  # 다시 호출했을때 칼럼명이 바뀌지 않음
df

      fn      ln   age   pres  posts      add
a  jason  miller  42.0    4.0   25.0    seoul
b    NaN     NaN   NaN    NaN    NaN  incheon
c   tina     ali  36.0    NaN    NaN  daejeon
d   jake  milner  24.0  100.0   62.0    pusan
e    amy  coozer  73.0    4.0   72.0  gwangju

In [139]:
# 덮어쓰기를 하거나 inplace='True' 사용

df.rename(columns = {'add' : 'address'}, inplace= True)  # 원본 반영
df

      fn      ln   age   pres  posts  address
a  jason  miller  42.0    4.0   25.0    seoul
b    NaN     NaN   NaN    NaN    NaN  incheon
c   tina     ali  36.0    NaN    NaN  daejeon
d   jake  milner  24.0  100.0   62.0    pusan
e    amy  coozer  73.0    4.0   72.0  gwangju

In [140]:
# column 또는 row를 삭제

In [142]:
# df.drop('address')  # 오류 'address' 행 열 표시 해줘야 함

df.drop('address', axis =1)  # 원본 반영 x
                             # drop 두번 불가

      fn      ln   age   pres  posts
a  jason  miller  42.0    4.0   25.0
b    NaN     NaN   NaN    NaN    NaN
c   tina     ali  36.0    NaN    NaN
d   jake  milner  24.0  100.0   62.0
e    amy  coozer  73.0    4.0   72.0

In [146]:
df.drop('address', axis =1, inplace=True)
df

      fn      ln   age   pres  posts
a  jason  miller  42.0    4.0   25.0
b    NaN     NaN   NaN    NaN    NaN
c   tina     ali  36.0    NaN    NaN
d   jake  milner  24.0  100.0   62.0
e    amy  coozer  73.0    4.0   72.0

In [148]:
# 행 삭제
df.drop('c', axis=0)
df

      fn      ln   age   pres  posts
a  jason  miller  42.0    4.0   25.0
b    NaN     NaN   NaN    NaN    NaN
c   tina     ali  36.0    NaN    NaN
d   jake  milner  24.0  100.0   62.0
e    amy  coozer  73.0    4.0   72.0

In [156]:
df.drop(['ln','pres'], axis =1)

      fn   age  posts
a  jason  42.0   25.0
b    NaN   NaN    NaN
c   tina  36.0    NaN
d   jake  24.0   62.0
e    amy  73.0   72.0